MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX254F128D.PIC
      <edc:AdjustPoint edc:_addr="0x1F800004" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="1" edc:offset="0xc"/>
      <edc:SFRDef edc:_addr="0x1F800010" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="1" edc:access="-----------------------nn--nnn--" edc:cname="DSWAKE" edc:desc="" edc:impl="0x19e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------00--000--" edc:name="DSWAKE" edc:nzwidth="32" edc:por="-----------------------00--000--">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSMCLR" edc:desc="" edc:mask="0x1" edc:name="DSMCLR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DSRTC" edc:desc="" edc:mask="0x1" edc:name="DSRTC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DSWDT" edc:desc="" edc:mask="0x1" edc:name="DSWDT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSFLT" edc:desc="" edc:mask="0x1" edc:name="DSFLT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DSINT0" edc:desc="" edc:mask="0x1" edc:name="DSINT0" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800014" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="1" edc:offset="0xc"/>
      <edc:SFRDef edc:_addr="0x1F800020" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR0" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800024" edc:offset="0x1c"/>
      <edc:SFRDef edc:_addr="0x1F800040" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR1" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800044" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR2" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800048" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR3" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80004C" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR4" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800050" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR5" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800054" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="7" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR6" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR6" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800058" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR7" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80005C" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="9" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR8" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR8" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
