MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX254F128D.PIC
      <edc:SFRDef edc:_addr="0x1F800240" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="rrrnnnnnrnnnnnnnrnnnnnnn--------" edc:cname="ALRMTIME" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000xxxxx0xxxxxxx0xxxxxxx--------" edc:name="ALRMTIME" edc:nzwidth="0x20" edc:por="000xxxxx0xxxxxxx0xxxxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SEC01" edc:desc="" edc:mask="0xf" edc:name="SEC01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SEC10" edc:desc="" edc:mask="0xf" edc:name="SEC10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN01" edc:desc="" edc:mask="0xf" edc:name="MIN01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN10" edc:desc="" edc:mask="0xf" edc:name="MIN10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR01" edc:desc="" edc:mask="0xf" edc:name="HR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR10" edc:desc="" edc:mask="0xf" edc:name="HR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800250" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="--------rrrnnnnnrrnnnnnn----rnnn" edc:cname="ALRMDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000xxxxx00xxxxxx----0xxx" edc:name="ALRMDATE" edc:nzwidth="0x20" edc:por="--------000xxxxx00xxxxxx----0xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY01" edc:desc="" edc:mask="0xf" edc:name="WDAY01" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAY01" edc:desc="" edc:mask="0xf" edc:name="DAY01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DAY10" edc:desc="" edc:mask="0xf" edc:name="DAY10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH01" edc:desc="" edc:mask="0xf" edc:name="MONTH01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH10" edc:desc="" edc:mask="0xf" edc:name="MONTH10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800260" edc:offset="928"/>
      <edc:SFRDef edc:_addr="0x1F800600" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02141_tmr_classa_pb_v2.Module" edc:_refcount="1" edc:access="----------------n-nnn-nnn-nn-nn-" edc:cname="T1CON" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00000-000-00-00-" edc:name="T1CON" edc:nzwidth="0x20" edc:por="----------------00000-000-00-00-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSYNC" edc:desc="" edc:mask="0x1" edc:name="TSYNC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TGATE" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TECS" edc:desc="" edc:mask="0x3" edc:name="TECS" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TWIP" edc:desc="" edc:mask="0x1" edc:name="TWIP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TWDIS" edc:desc="" edc:mask="0x1" edc:name="TWDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TECS0" edc:desc="" edc:mask="0x1" edc:name="TECS0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TECS1" edc:desc="" edc:mask="0x1" edc:name="TECS1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800610" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02141_tmr_classa_pb_v2.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TMR1" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800620" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02141_tmr_classa_pb_v2.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PR1" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR1" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
